ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/psoc6csp/hal/source/cyhal_clock.c
cy_rslt_t cyhal_clock_set_enabled(cyhal_clock_t *clock, bool enabled, bool wait_for_lock)
{
    CY_ASSERT(NULL != clock);
    CY_ASSERT(_cyhal_utils_is_new_clock_format(clock));

    /* Timeout values are from the device datasheet. */

    switch (clock->block)
    {
#if SRSS_ECO_PRESENT
        case CYHAL_CLOCK_BLOCK_ECO:
            if (enabled)
            {
                if (0u != (SRSS_CLK_ECO_CONFIG & SRSS_CLK_ECO_CONFIG_ECO_EN_Msk))
                {
                    // Already enabled
                    if (wait_for_lock)
                    {
                        for (int t = 0; t < 3 && Cy_SysClk_EcoGetStatus() != CY_SYSCLK_ECOSTAT_STABLE; ++t)
                        {
                            Cy_SysLib_DelayUs(1000UL);
                        }
                        return Cy_SysClk_EcoGetStatus() == CY_SYSCLK_ECOSTAT_STABLE
                            ? CY_RSLT_SUCCESS
                            : CY_SYSCLK_TIMEOUT;
                    }
                    return CY_RSLT_SUCCESS;
                }
                else
                {
                    return Cy_SysClk_EcoEnable(wait_for_lock ? 3000UL : 0UL);
                }
            }
            else
            {
                Cy_SysClk_EcoDisable();
                return CY_RSLT_SUCCESS;
            }
#endif
        case CYHAL_CLOCK_BLOCK_ILO:
            if (enabled)
                Cy_SysClk_IloEnable();
            else
                Cy_SysClk_IloDisable();
            return CY_RSLT_SUCCESS;
#if SRSS_PILO_PRESENT
        case CYHAL_CLOCK_BLOCK_PILO:
            if (enabled)
                Cy_SysClk_PiloEnable();
            else
                Cy_SysClk_PiloDisable();
            return CY_RSLT_SUCCESS;
#endif
#if SRSS_BACKUP_PRESENT
        case CYHAL_CLOCK_BLOCK_WCO:
            if (enabled)
            {
                cy_rslt_t rslt = Cy_SysClk_WcoEnable(wait_for_lock ? 1000000UL : 0UL);
                // Ignore CY_SYSCLK_TIMEOUT unless wait_for_lock is true
                return wait_for_lock ? rslt : CY_RSLT_SUCCESS;
            }
            else
            {
                Cy_SysClk_WcoDisable();
                return CY_RSLT_SUCCESS;
            }
#endif
#if SRSS_MFO_PRESENT
        case CYHAL_CLOCK_BLOCK_MFO:
            if (enabled)
                Cy_SysClk_MfoEnable(true);
            else
                Cy_SysClk_MfoDisable();
            return CY_RSLT_SUCCESS;
#endif
        case CYHAL_CLOCK_BLOCK_FLL:
            return _cyhal_clock_change_fll_enablement(enabled, wait_for_lock);

#if (SRSS_NUM_PLL > 0)
        case CYHAL_CLOCK_BLOCK_PLL:
            return _cyhal_clock_change_pll_enablement(clock->channel + 1, enabled, wait_for_lock);
#endif
#if SRSS_MFO_PRESENT
        case CYHAL_CLOCK_BLOCK_MF:
            if (enabled)
                Cy_SysClk_ClkMfEnable();
            else
                Cy_SysClk_ClkMfDisable();
            return CY_RSLT_SUCCESS;
#endif
        case CYHAL_CLOCK_BLOCK_HF:
            return (enabled)
                ? Cy_SysClk_ClkHfEnable(clock->channel)
                : Cy_SysClk_ClkHfDisable(clock->channel);
        case CYHAL_CLOCK_BLOCK_PUMP:
            if (enabled)
                Cy_SysClk_ClkPumpEnable();
            else
                Cy_SysClk_ClkPumpDisable();
            return CY_RSLT_SUCCESS;
        case CYHAL_CLOCK_BLOCK_TIMER:
            if (enabled)
                Cy_SysClk_ClkTimerEnable();
            else
                Cy_SysClk_ClkTimerDisable();
            return CY_RSLT_SUCCESS;
        case CYHAL_CLOCK_BLOCK_PERIPHERAL_8BIT:
        case CYHAL_CLOCK_BLOCK_PERIPHERAL_16BIT:
        case CYHAL_CLOCK_BLOCK_PERIPHERAL_16_5BIT:
        case CYHAL_CLOCK_BLOCK_PERIPHERAL_24_5BIT:
            return (enabled)
                ? Cy_SysClk_PeriphEnableDivider((cy_en_divider_types_t)clock->block, clock->channel)
                : Cy_SysClk_PeriphDisableDivider((cy_en_divider_types_t)clock->block, clock->channel);
        default:
            CY_ASSERT(false); //Unhandled clock
            return CYHAL_CLOCK_RSLT_ERR_RESOURCE;
    }
}

uint32_t cyhal_clock_get_frequency(const cyhal_clock_t *clock)
{
    CY_ASSERT(NULL != clock);
    CY_ASSERT(_cyhal_utils_is_new_clock_format(clock));

    if (!cyhal_clock_is_enabled(clock))
    {
        return 0;
    }

    switch (clock->block)
    {
        case CYHAL_CLOCK_BLOCK_IMO:
            return CY_SYSCLK_IMO_FREQ;
#if SRSS_ECO_PRESENT
        case CYHAL_CLOCK_BLOCK_ECO:
            return Cy_SysClk_EcoGetFrequency();
#endif
        case CYHAL_CLOCK_BLOCK_EXT:
            return Cy_SysClk_ExtClkGetFrequency();
#if SRSS_ALTHF_PRESENT
        case CYHAL_CLOCK_BLOCK_ALTHF:
            return Cy_SysClk_AltHfGetFrequency();
#endif
#if SRSS_ALTLF_PRESENT
        case CYHAL_CLOCK_BLOCK_ALTLF:
            return Cy_SysClk_AltLfGetFrequency();
#endif
#if SRSS_MFO_PRESENT
        case CYHAL_CLOCK_BLOCK_MFO:
            return CY_SYSCLK_MFO_FREQ;
#endif
        case CYHAL_CLOCK_BLOCK_ILO:
            return CY_SYSCLK_ILO_FREQ;
#if SRSS_PILO_PRESENT
        case CYHAL_CLOCK_BLOCK_PILO:
            return CY_SYSCLK_PILO_FREQ;
#endif
#if SRSS_BACKUP_PRESENT
        case CYHAL_CLOCK_BLOCK_WCO:
            return CY_SYSCLK_WCO_FREQ;
#endif
        case CYHAL_CLOCK_BLOCK_PATHMUX:
            return Cy_SysClk_ClkPathMuxGetFrequency(clock->channel);
        case CYHAL_CLOCK_BLOCK_FLL:
            return Cy_SysClk_FllIsEnabled()
                ? Cy_SysClk_ClkPathGetFrequency(0)
                : 0;
#if (SRSS_NUM_PLL > 0)
        case CYHAL_CLOCK_BLOCK_PLL:
            return Cy_SysClk_PllIsEnabled(clock->channel + 1)
                ? Cy_SysClk_ClkPathGetFrequency(clock->channel + 1)
                : 0;
#endif
#if SRSS_MFO_PRESENT
        case CYHAL_CLOCK_BLOCK_MF:
            return Cy_SysClk_ClkMfGetFrequency();
#endif
        case CYHAL_CLOCK_BLOCK_HF:
            return Cy_SysClk_ClkHfGetFrequency(clock->channel);
        case CYHAL_CLOCK_BLOCK_PUMP:
            return Cy_SysClk_ClkPumpGetFrequency();
        case CYHAL_CLOCK_BLOCK_TIMER:
            return Cy_SysClk_ClkTimerGetFrequency();
        case CYHAL_CLOCK_BLOCK_LF:
            return _cyhal_clock_get_lf_frequency();
        case CYHAL_CLOCK_BLOCK_BAK:
        {
            cy_en_clkbak_in_sources_t src = Cy_SysClk_ClkBakGetSource();
#if SRSS_BACKUP_PRESENT
            if (src == CY_SYSCLK_BAK_IN_WCO)
                return CY_SYSCLK_WCO_FREQ;
            else
#endif
            return _cyhal_clock_get_lf_frequency();
        }
        case CYHAL_CLOCK_BLOCK_FAST:
            return Cy_SysClk_ClkFastGetFrequency();
        case CYHAL_CLOCK_BLOCK_PERI:
            return Cy_SysClk_ClkPeriGetFrequency();
        case CYHAL_CLOCK_BLOCK_SLOW:
            return Cy_SysClk_ClkSlowGetFrequency();
        case CYHAL_CLOCK_BLOCK_PERIPHERAL_8BIT:
        case CYHAL_CLOCK_BLOCK_PERIPHERAL_16BIT:
        case CYHAL_CLOCK_BLOCK_PERIPHERAL_16_5BIT:
        case CYHAL_CLOCK_BLOCK_PERIPHERAL_24_5BIT:
            return Cy_SysClk_PeriphGetFrequency((cy_en_divider_types_t)clock->block, clock->channel);
        case CYHAL_CLOCK_BLOCK_ALT_SYS_TICK:
        default:
            CY_ASSERT(false); //Unhandled clock
            return 0;
    }
}

cy_rslt_t cyhal_clock_set_frequency(cyhal_clock_t *clock, uint32_t hz, const cyhal_clock_tolerance_t *tolerance)
{
    CY_ASSERT(NULL != clock);
    CY_ASSERT(_cyhal_utils_is_new_clock_format(clock));

    switch (clock->block)
    {
        case CYHAL_CLOCK_BLOCK_EXT:
            Cy_SysClk_ExtClkSetFrequency(hz);
            return CY_RSLT_SUCCESS;
        case CYHAL_CLOCK_BLOCK_FLL:
            return _cyhal_clock_set_fll_freq(hz);
#if (SRSS_NUM_PLL > 0)
        case CYHAL_CLOCK_BLOCK_PLL:
            return _cyhal_clock_set_pll_freq(clock->channel + 1, hz);
#endif
#if SRSS_MFO_PRESENT
        case CYHAL_CLOCK_BLOCK_MF:
        {
            uint32_t div;
            cy_rslt_t rslt = _cyhal_clock_compute_div(CY_SYSCLK_MFO_FREQ, hz, 8, tolerance, &div);

            if (CY_RSLT_SUCCESS == rslt)
                Cy_SysClk_ClkMfSetDivider(div);

            return rslt;
        }
#endif
        case CYHAL_CLOCK_BLOCK_FAST:
        case CYHAL_CLOCK_BLOCK_PERI:
        {
            uint32_t div;
            uint32_t input_hz = Cy_SysClk_ClkHfGetFrequency(0);
            cy_rslt_t rslt = _cyhal_clock_compute_div(input_hz, hz, 8, tolerance, &div);

            if (CY_RSLT_SUCCESS == rslt)
            {
                if (CYHAL_CLOCK_BLOCK_PERI == clock->block)
                    Cy_SysClk_ClkPeriSetDivider((uint8_t)(div - 1));
                else
                    Cy_SysClk_ClkFastSetDivider((uint8_t)(div - 1));

                SystemCoreClockUpdate();
            }

            return rslt;
        }
        case CYHAL_CLOCK_BLOCK_SLOW:
        {
            uint32_t div;
            uint32_t input_hz = Cy_SysClk_ClkPeriGetFrequency();
            cy_rslt_t rslt = _cyhal_clock_compute_div(input_hz, hz, 8, tolerance, &div);

            if (CY_RSLT_SUCCESS == rslt)
            {
                Cy_SysClk_ClkSlowSetDivider((uint8_t)(div - 1));
                SystemCoreClockUpdate();
            }

            return rslt;
        }
        case CYHAL_CLOCK_BLOCK_PERIPHERAL_8BIT:
        case CYHAL_CLOCK_BLOCK_PERIPHERAL_16BIT:
        {
            uint32_t div;
            uint32_t input_hz = Cy_SysClk_ClkPeriGetFrequency();
            uint32_t bits = (clock->block == CYHAL_CLOCK_BLOCK_PERIPHERAL_8BIT) ? 8 : 16;
            cy_rslt_t rslt = _cyhal_clock_compute_div(input_hz, hz, bits, tolerance, &div);
            return (CY_RSLT_SUCCESS == rslt)
                ? Cy_SysClk_PeriphSetDivider((cy_en_divider_types_t)clock->block, clock->channel, (div - 1))
                : rslt;
        }
        case CYHAL_CLOCK_BLOCK_PERIPHERAL_16_5BIT:
        case CYHAL_CLOCK_BLOCK_PERIPHERAL_24_5BIT:
        {
            uint32_t div;
            uint32_t input_hz = Cy_SysClk_ClkPeriGetFrequency();
            // Multiply input by 32 so we can treat the 5 fractional bits as though they are extentions of the integer divider
            // Leave the the desired frequency alone, so we can just strip out the integer & fractional bits at the end.
            uint32_t bits = (clock->block == CYHAL_CLOCK_BLOCK_PERIPHERAL_16_5BIT) ? 21 : 29; // Integer bits + 5
            cy_rslt_t rslt = _cyhal_clock_compute_div(input_hz << 5, hz, bits, tolerance, &div);
            if (CY_RSLT_SUCCESS == rslt)
            {
                uint32_t div_int = (div >> 5) - 1;
                uint32_t div_frac = div & 0x1F;
                return Cy_SysClk_PeriphSetFracDivider((cy_en_divider_types_t)clock->block, clock->channel, div_int, div_frac);
            }
            else
                return rslt;
        }
        default:
            CY_ASSERT(false); //Unhandled clock
            return CYHAL_CLOCK_RSLT_ERR_NOT_SUPPORTED;
    }
}

