ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/psoc6csp/hal/source/cyhal_clock.c
cy_rslt_t cyhal_clock_set_divider(cyhal_clock_t *clock, uint32_t divider)
{
    CY_ASSERT(NULL != clock);
    CY_ASSERT(_cyhal_utils_is_new_clock_format(clock));

    switch (clock->block)
    {
#if SRSS_MFO_PRESENT
        case CYHAL_CLOCK_BLOCK_MF:
#endif
        case CYHAL_CLOCK_BLOCK_FAST:
        case CYHAL_CLOCK_BLOCK_PERI:
        case CYHAL_CLOCK_BLOCK_SLOW:
        case CYHAL_CLOCK_BLOCK_TIMER:
            if (divider <= 256)
            {
                uint32_t divVal = divider - 1;
                switch ((uint8_t)clock->block)
                {
#if SRSS_MFO_PRESENT
                    case CYHAL_CLOCK_BLOCK_MF:
                        Cy_SysClk_ClkMfSetDivider(divVal);
                        return CY_RSLT_SUCCESS;
#endif
                    case CYHAL_CLOCK_BLOCK_FAST:
                        Cy_SysClk_ClkFastSetDivider((uint8_t)divVal);
                        SystemCoreClockUpdate();
                        return CY_RSLT_SUCCESS;
                    case CYHAL_CLOCK_BLOCK_SLOW:
                        Cy_SysClk_ClkSlowSetDivider((uint8_t)divVal);
                        SystemCoreClockUpdate();
                        return CY_RSLT_SUCCESS;
                    case CYHAL_CLOCK_BLOCK_PERI:
                        Cy_SysClk_ClkPeriSetDivider((uint8_t)divVal);
                        SystemCoreClockUpdate();
                        return CY_RSLT_SUCCESS;
                    case CYHAL_CLOCK_BLOCK_TIMER:
                        Cy_SysClk_ClkTimerSetDivider((uint8_t)divVal);
                        return CY_RSLT_SUCCESS;
                }
            }
            return CYHAL_CLOCK_RSLT_ERR_FREQ;

        case CYHAL_CLOCK_BLOCK_HF:
            return _cyhal_clock_set_hfclk_div(clock->channel, divider);
        case CYHAL_CLOCK_BLOCK_PUMP:
        {
            cy_en_clkpump_divide_t divVal;
            switch (divider)
            {
                case 1:
                    divVal = CY_SYSCLK_PUMP_NO_DIV;
                    break;
                case 2:
                    divVal = CY_SYSCLK_PUMP_DIV_2;
                    break;
                case 4:
                    divVal = CY_SYSCLK_PUMP_DIV_4;
                    break;
                case 8:
                    divVal = CY_SYSCLK_PUMP_DIV_8;
                    break;
                case 16:
                    divVal = CY_SYSCLK_PUMP_DIV_16;
                    break;
                default:
                    return CYHAL_CLOCK_RSLT_ERR_FREQ;
            }
            Cy_SysClk_ClkPumpSetDivider(divVal);
            return CY_RSLT_SUCCESS;
        }
        case CYHAL_CLOCK_BLOCK_PERIPHERAL_8BIT:
        case CYHAL_CLOCK_BLOCK_PERIPHERAL_16BIT:
            return Cy_SysClk_PeriphSetDivider((cy_en_divider_types_t)clock->block, clock->channel, divider - 1);
        case CYHAL_CLOCK_BLOCK_PERIPHERAL_16_5BIT:
        case CYHAL_CLOCK_BLOCK_PERIPHERAL_24_5BIT:
            return Cy_SysClk_PeriphSetFracDivider((cy_en_divider_types_t)clock->block, clock->channel, divider - 1, 0);
        default:
            CY_ASSERT(false); //Unhandled clock
            return CYHAL_CLOCK_RSLT_ERR_NOT_SUPPORTED;
    }
}

cy_rslt_t cyhal_clock_get_sources(const cyhal_clock_t *clock, const cyhal_resource_inst_t **sources[], uint32_t *count)
{
    static const cyhal_resource_inst_t *_CYHAL_CLOCK_SOURCE_PATHMUX[] =
    {
        &CYHAL_CLOCK_IMO,
    #if SRSS_ECO_PRESENT
        &CYHAL_CLOCK_ECO,
    #endif
        &CYHAL_CLOCK_EXT,
    #if SRSS_ALTHF_PRESENT
        &CYHAL_CLOCK_ALTHF,
    #endif
        &CYHAL_CLOCK_ILO,
    #if SRSS_PILO_PRESENT
        &CYHAL_CLOCK_PILO,
    #endif
    #if SRSS_BACKUP_PRESENT
        &CYHAL_CLOCK_WCO,
    #endif
    #if SRSS_ALTLF_PRESENT
        &CYHAL_CLOCK_ALTLF,
    #endif
    };
    #if SRSS_MFO_PRESENT
    static const cyhal_resource_inst_t *_CYHAL_CLOCK_SOURCE_MFO[] =
    {
        &CYHAL_CLOCK_IMO,
    };
    static const cyhal_resource_inst_t *_CYHAL_CLOCK_SOURCE_MF[] =
    {
        &CYHAL_CLOCK_MFO,
    };
    #endif
    static const cyhal_resource_inst_t *_CYHAL_CLOCK_SOURCE_SLOW[] =
    {
        &CYHAL_CLOCK_PERI,
    };
    static const cyhal_resource_inst_t *_CYHAL_CLOCK_SOURCE_FAST[] =
    {
        &CYHAL_CLOCK_HF[0],
    };
    static const cyhal_resource_inst_t *_CYHAL_CLOCK_SOURCE_TIMER[] =
    {
        &CYHAL_CLOCK_IMO,
        &CYHAL_CLOCK_HF[0],
    };
    static const cyhal_resource_inst_t *_CYHAL_CLOCK_SOURCE_ALT_SYS_TICK[] =
    {
        &CYHAL_CLOCK_IMO,
    #if SRSS_ECO_PRESENT
        &CYHAL_CLOCK_ECO,
    #endif
        &CYHAL_CLOCK_TIMER,
        &CYHAL_CLOCK_LF,
        &CYHAL_CLOCK_FAST,
        &CYHAL_CLOCK_SLOW,
    };
    static const cyhal_resource_inst_t *_CYHAL_CLOCK_SOURCE_BAK[] =
    {
        &CYHAL_CLOCK_LF,
    #if SRSS_BACKUP_PRESENT
        &CYHAL_CLOCK_WCO,
    #endif
    };
    static const cyhal_resource_inst_t *_CYHAL_CLOCK_SOURCE_LF[] =
    {
        &CYHAL_CLOCK_ILO,
    #if SRSS_PILO_PRESENT
        &CYHAL_CLOCK_PILO,
    #endif
    #if SRSS_BACKUP_PRESENT
        &CYHAL_CLOCK_WCO,
    #endif
    #if SRSS_ALTLF_PRESENT
        &CYHAL_CLOCK_ALTLF,
    #endif
    };
    static const cyhal_resource_inst_t *_CYHAL_CLOCK_SOURCE_HF[] =
    {
        &CYHAL_CLOCK_FLL,
    #if (SRSS_NUM_PLL > 0)
        &CYHAL_CLOCK_PLL[0],
    #endif
    #if (SRSS_NUM_PLL > 1)
        &CYHAL_CLOCK_PLL[1],
    #endif
    #if (SRSS_NUM_PLL > 2)
        &CYHAL_CLOCK_PLL[2],
    #endif
    #if (SRSS_NUM_PLL > 3)
        &CYHAL_CLOCK_PLL[3],
    #endif
    #if (SRSS_NUM_PLL > 4)
        &CYHAL_CLOCK_PLL[4],
    #endif
    #if (SRSS_NUM_PLL > 5)
        &CYHAL_CLOCK_PLL[5],
    #endif
    #if (SRSS_NUM_PLL > 6)
        &CYHAL_CLOCK_PLL[6],
    #endif
    #if (SRSS_NUM_PLL > 7)
        &CYHAL_CLOCK_PLL[7],
    #endif
    #if (SRSS_NUM_PLL > 8)
        &CYHAL_CLOCK_PLL[8],
    #endif
    #if (SRSS_NUM_PLL > 9)
        &CYHAL_CLOCK_PLL[9],
    #endif
    #if (SRSS_NUM_PLL > 10)
        &CYHAL_CLOCK_PLL[10],
    #endif
    #if (SRSS_NUM_PLL > 11)
        &CYHAL_CLOCK_PLL[11],
    #endif
    #if (SRSS_NUM_PLL > 12)
        &CYHAL_CLOCK_PLL[12],
    #endif
    #if (SRSS_NUM_PLL > 13)
        &CYHAL_CLOCK_PLL[13],
    #endif
    #if (SRSS_NUM_PLL > 14)
        &CYHAL_CLOCK_PLL[14],
    #endif
        &CYHAL_CLOCK_PATHMUX[0],
    #if (SRSS_NUM_CLKPATH > 1)
        &CYHAL_CLOCK_PATHMUX[1],
    #endif
    #if (SRSS_NUM_CLKPATH > 2)
        &CYHAL_CLOCK_PATHMUX[2],
    #endif
    #if (SRSS_NUM_CLKPATH > 3)
        &CYHAL_CLOCK_PATHMUX[3],
    #endif
    #if (SRSS_NUM_CLKPATH > 4)
        &CYHAL_CLOCK_PATHMUX[4],
    #endif
    #if (SRSS_NUM_CLKPATH > 5)
        &CYHAL_CLOCK_PATHMUX[5],
    #endif
    #if (SRSS_NUM_CLKPATH > 6)
        &CYHAL_CLOCK_PATHMUX[6],
    #endif
    #if (SRSS_NUM_CLKPATH > 7)
        &CYHAL_CLOCK_PATHMUX[7],
    #endif
    #if (SRSS_NUM_CLKPATH > 8)
        &CYHAL_CLOCK_PATHMUX[8],
    #endif
    #if (SRSS_NUM_CLKPATH > 9)
        &CYHAL_CLOCK_PATHMUX[9],
    #endif
    #if (SRSS_NUM_CLKPATH > 10)
        &CYHAL_CLOCK_PATHMUX[10],
    #endif
    #if (SRSS_NUM_CLKPATH > 11)
        &CYHAL_CLOCK_PATHMUX[11],
    #endif
    #if (SRSS_NUM_CLKPATH > 12)
        &CYHAL_CLOCK_PATHMUX[12],
    #endif
    #if (SRSS_NUM_CLKPATH > 13)
        &CYHAL_CLOCK_PATHMUX[13],
    #endif
    #if (SRSS_NUM_CLKPATH > 14)
        &CYHAL_CLOCK_PATHMUX[14],
    #endif
    #if (SRSS_NUM_CLKPATH > 15)
        &CYHAL_CLOCK_PATHMUX[15],
    #endif
    };

