ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/psoc6csp/hal/source/cyhal_clock.c
    CY_ASSERT(NULL != clock);
    CY_ASSERT(_cyhal_utils_is_new_clock_format(clock));

    switch (clock->block)
    {
        case CYHAL_CLOCK_BLOCK_IMO:
#if SRSS_ECO_PRESENT
        case CYHAL_CLOCK_BLOCK_ECO:
#endif
        case CYHAL_CLOCK_BLOCK_EXT:
#if SRSS_ALTHF_PRESENT
        case CYHAL_CLOCK_BLOCK_ALTHF:
#endif
#if SRSS_ALTLF_PRESENT
        case CYHAL_CLOCK_BLOCK_ALTLF:
#endif
        case CYHAL_CLOCK_BLOCK_ILO:
#if SRSS_PILO_PRESENT
        case CYHAL_CLOCK_BLOCK_PILO:
#endif
#if SRSS_BACKUP_PRESENT
        case CYHAL_CLOCK_BLOCK_WCO:
            *count = 0;
            break;
#endif
#if SRSS_MFO_PRESENT
        case CYHAL_CLOCK_BLOCK_MFO:
            *sources = _CYHAL_CLOCK_SOURCE_MFO;
            *count = sizeof(_CYHAL_CLOCK_SOURCE_MFO) / sizeof(_CYHAL_CLOCK_SOURCE_MFO[0]);
            break;
        case CYHAL_CLOCK_BLOCK_MF:
            *sources = _CYHAL_CLOCK_SOURCE_MF;
            *count = sizeof(_CYHAL_CLOCK_SOURCE_MF) / sizeof(_CYHAL_CLOCK_SOURCE_MF[0]);
            break;
#endif
        case CYHAL_CLOCK_BLOCK_PATHMUX:
            *sources = _CYHAL_CLOCK_SOURCE_PATHMUX;
            *count = sizeof(_CYHAL_CLOCK_SOURCE_PATHMUX) / sizeof(_CYHAL_CLOCK_SOURCE_PATHMUX[0]);
            break;
        case CYHAL_CLOCK_BLOCK_FLL:
            *sources = &(_CYHAL_CLOCK_SOURCE_HF[1 + SRSS_NUM_PLL]); /* PATHMUX[0] entry is after the FLL/PLLs */
            *count = 1;
            break;
#if (SRSS_NUM_PLL > 0)
        case CYHAL_CLOCK_BLOCK_PLL:
            *sources = &(_CYHAL_CLOCK_SOURCE_HF[2 + SRSS_NUM_PLL + clock->channel]); /* PATHMUX[n] entry is after the FLL/PLLs + 1 for FLL path */
            *count = 1;
            break;
#endif
        case CYHAL_CLOCK_BLOCK_LF:
            *sources = _CYHAL_CLOCK_SOURCE_LF;
            *count = sizeof(_CYHAL_CLOCK_SOURCE_LF) / sizeof(_CYHAL_CLOCK_SOURCE_LF[0]);
            break;
        case CYHAL_CLOCK_BLOCK_HF:
        case CYHAL_CLOCK_BLOCK_PUMP:
            *sources = _CYHAL_CLOCK_SOURCE_HF;
            *count = sizeof(_CYHAL_CLOCK_SOURCE_HF) / sizeof(_CYHAL_CLOCK_SOURCE_HF[0]);
            break;
        case CYHAL_CLOCK_BLOCK_BAK:
            *sources = _CYHAL_CLOCK_SOURCE_BAK;
            *count = sizeof(_CYHAL_CLOCK_SOURCE_BAK) / sizeof(_CYHAL_CLOCK_SOURCE_BAK[0]);
            break;
        case CYHAL_CLOCK_BLOCK_FAST:
        case CYHAL_CLOCK_BLOCK_PERI:
            *sources = _CYHAL_CLOCK_SOURCE_FAST;
            *count = sizeof(_CYHAL_CLOCK_SOURCE_FAST) / sizeof(_CYHAL_CLOCK_SOURCE_FAST[0]);
            break;
        case CYHAL_CLOCK_BLOCK_TIMER:
            *sources = _CYHAL_CLOCK_SOURCE_TIMER;
            *count = sizeof(_CYHAL_CLOCK_SOURCE_TIMER) / sizeof(_CYHAL_CLOCK_SOURCE_TIMER[0]);
            break;
        case CYHAL_CLOCK_BLOCK_SLOW:
        case CYHAL_CLOCK_BLOCK_PERIPHERAL_8BIT:
        case CYHAL_CLOCK_BLOCK_PERIPHERAL_16BIT:
        case CYHAL_CLOCK_BLOCK_PERIPHERAL_16_5BIT:
        case CYHAL_CLOCK_BLOCK_PERIPHERAL_24_5BIT:
            *sources = _CYHAL_CLOCK_SOURCE_SLOW;
            *count = sizeof(_CYHAL_CLOCK_SOURCE_SLOW) / sizeof(_CYHAL_CLOCK_SOURCE_SLOW[0]);
            break;
        case CYHAL_CLOCK_BLOCK_ALT_SYS_TICK:
            *sources = _CYHAL_CLOCK_SOURCE_ALT_SYS_TICK;
            *count = sizeof(_CYHAL_CLOCK_SOURCE_ALT_SYS_TICK) / sizeof(_CYHAL_CLOCK_SOURCE_ALT_SYS_TICK[0]);
            break;
        default:
            CY_ASSERT(false); //Unhandled clock
            *count = 0;
            return CYHAL_CLOCK_RSLT_ERR_RESOURCE;
    }
    return CY_RSLT_SUCCESS;
}

cy_rslt_t cyhal_clock_set_source(cyhal_clock_t *clock, const cyhal_clock_t *source)
{
    CY_ASSERT(NULL != clock && NULL != source);
    CY_ASSERT(_cyhal_utils_is_new_clock_format(clock));

    switch (clock->block)
    {
        case CYHAL_CLOCK_BLOCK_HF:
            return _cyhal_clock_set_hfclk_source(clock->channel, source);
        case CYHAL_CLOCK_BLOCK_PUMP:
            if (source->block == CYHAL_CLOCK_BLOCK_PATHMUX || source->block == CYHAL_CLOCK_BLOCK_FLL)
            {
                Cy_SysClk_ClkPumpSetSource((cy_en_clkpump_in_sources_t)source->channel);
                return CY_RSLT_SUCCESS;
            }
            else if (source->block == CYHAL_CLOCK_BLOCK_PLL)
            {
                Cy_SysClk_ClkPumpSetSource((cy_en_clkpump_in_sources_t)(source->channel + 1));
                return CY_RSLT_SUCCESS;
            }
            else
                return CYHAL_CLOCK_RSLT_ERR_SOURCE;
        case CYHAL_CLOCK_BLOCK_TIMER:
            if (source->block == CYHAL_CLOCK_BLOCK_IMO)
            {
                Cy_SysClk_ClkTimerSetSource(CY_SYSCLK_CLKTIMER_IN_IMO);
                return CY_RSLT_SUCCESS;
            }
            else if (source->block == CYHAL_CLOCK_BLOCK_HF && source->channel == 0)
            {
                Cy_SysClk_ClkTimerSetSource(CY_SYSCLK_CLKTIMER_IN_HF0_NODIV);
                return CY_RSLT_SUCCESS;
            }
            return CYHAL_CLOCK_RSLT_ERR_SOURCE;
        case CYHAL_CLOCK_BLOCK_PATHMUX:
            return _cyhal_clock_set_pathmux_source(clock->channel, source->block);
        case CYHAL_CLOCK_BLOCK_LF:
            switch (source->block)
            {
                case CYHAL_CLOCK_BLOCK_ILO:
                    Cy_SysClk_ClkLfSetSource(CY_SYSCLK_CLKLF_IN_ILO);
                    return CY_RSLT_SUCCESS;
#if SRSS_BACKUP_PRESENT
                case CYHAL_CLOCK_BLOCK_WCO:
                    Cy_SysClk_ClkLfSetSource(CY_SYSCLK_CLKLF_IN_WCO);
                    return CY_RSLT_SUCCESS;
#endif
#if SRSS_ALTLF_PRESENT
                case CYHAL_CLOCK_BLOCK_ALTLF:
                    Cy_SysClk_ClkLfSetSource(CY_SYSCLK_CLKLF_IN_ALTLF);
                    return CY_RSLT_SUCCESS;
#endif
#if SRSS_PILO_PRESENT
                case CYHAL_CLOCK_BLOCK_PILO:
                    Cy_SysClk_ClkLfSetSource(CY_SYSCLK_CLKLF_IN_PILO);
                    return CY_RSLT_SUCCESS;
#endif
                default:
                    CY_ASSERT(false); //Unhandled clock
                    return CYHAL_CLOCK_RSLT_ERR_SOURCE;
            }
        case CYHAL_CLOCK_BLOCK_BAK:
            if (source->block == CYHAL_CLOCK_BLOCK_LF)
            {
                Cy_SysClk_ClkBakSetSource(CY_SYSCLK_BAK_IN_CLKLF);
                return CY_RSLT_SUCCESS;
            }
#if SRSS_BACKUP_PRESENT
            else if (source->block == CYHAL_CLOCK_BLOCK_WCO)
            {
                Cy_SysClk_ClkBakSetSource(CY_SYSCLK_BAK_IN_WCO);
                return CY_RSLT_SUCCESS;
            }
#endif
            return CYHAL_CLOCK_RSLT_ERR_SOURCE;
        case CYHAL_CLOCK_BLOCK_ALT_SYS_TICK:
            switch (source->block)
            {
                case CYHAL_CLOCK_BLOCK_LF:
                    Cy_SysTick_SetClockSource(CY_SYSTICK_CLOCK_SOURCE_CLK_LF);
                    return CY_RSLT_SUCCESS;
                case CYHAL_CLOCK_BLOCK_IMO:
                    Cy_SysTick_SetClockSource(CY_SYSTICK_CLOCK_SOURCE_CLK_IMO);
                    return CY_RSLT_SUCCESS;
#if SRSS_ECO_PRESENT
                case CYHAL_CLOCK_BLOCK_ECO:
                    Cy_SysTick_SetClockSource(CY_SYSTICK_CLOCK_SOURCE_CLK_ECO);
                    return CY_RSLT_SUCCESS;
#endif
                case CYHAL_CLOCK_BLOCK_TIMER:
                    Cy_SysTick_SetClockSource(CY_SYSTICK_CLOCK_SOURCE_CLK_TIMER);
                    return CY_RSLT_SUCCESS;
                case CYHAL_CLOCK_BLOCK_FAST:
                case CYHAL_CLOCK_BLOCK_SLOW:
                    Cy_SysTick_SetClockSource(CY_SYSTICK_CLOCK_SOURCE_CLK_CPU);
                    return CY_RSLT_SUCCESS;
                default:
                    CY_ASSERT(false); //Unhandled clock
                    return CYHAL_CLOCK_RSLT_ERR_SOURCE;
            }
        default:
            CY_ASSERT(false); //Unhandled clock
            return CYHAL_CLOCK_RSLT_ERR_NOT_SUPPORTED;
    }
}

void cyhal_clock_free(cyhal_clock_t *clock)
{
    CY_ASSERT(NULL != clock);
    CY_ASSERT(_cyhal_utils_is_new_clock_format(clock));

    cyhal_resource_inst_t rsc = { CYHAL_RSC_CLOCK, clock->block, clock->channel };
    cyhal_hwmgr_free(&rsc);
    clock->reserved = false;
}

#if defined(__cplusplus)
}
#endif
